package lesson2;

import java.util.Scanner;

public class Main {
    public static void main(String[] args) {
        System.out.println("Lesson 2");
        Scanner input =  new Scanner(System.in);
        System.out.print("Введите строку: ");
        String paliString = input.next();

    }
    public static boolean Palindrom(String st) {
        System.out.println("Введите строку");
        return true;

    }

//            1. Напишите метод, который принимает на вход строку (String) и
//        определяет является ли строка палиндромом (возвращает boolean значение).


}
